python, numpy, pandas 날짜 타입 비교 및 정리

- datetime은 python 설치 시 기본적으로 내장된 라이브러리로, 날짜를 쓸 것인지(date), 시간을 쓸 것인지(time), 날짜시간을 합쳐쓸 것인지에(datetime) 따라 클래스가 분화되어 있는 것이 특징. 예를들어 '2021-3-16'을 표시하고 싶으면 date 클래스를 사용하고, '2021-3-16 12:34:21'를 표시하고 싶으면 'datetime' 클래스를 사용합니다. 
- 반면 datetime64나 Timestamp는 각각 numpy, pandas 라이브러리에서 새로 정의한 날짜시간 클래스입니다. 이 둘은 numpy, pandas를 설치해야만 이용할 수 있고, 한 클래스로 날짜, 시간, 날짜시간을 모두 정의할 수 있는 것이 특징
- 날짜, 시간 타입은 일반적인 정수, 실수끼리 연산할 때와 달리 단위를 가지고 있는 점 때문에 시간의 차이를 저장하는 별도의 클래스가 있다는 특징. 이를 timedelta(타임델타)라고 하는데, 날짜, 시간은 특정 시점의 시각을 표시하는 용도이고(2021년 3월 16일), 타임델타는 기간 또는 시간 차이를 표시하는 용도(5일)

- https://ellun.tistory.com/320

<img src='dataset/날짜타입.jpg' STYLE='width:500px;'>

### 파이썬 날짜, 시간

In [1]:
#timestamp -> str
import time 

t = time.time()
print(t, type(t))  #현재 - 1970년 1월 1일을 초단위로 뺀 결과
#실수로 날짜, 시간을 나타냄 

s = str(time.time())
print(s, type(s))

1656570971.5435874 <class 'float'>
1656570971.5435874 <class 'str'>

In [2]:
#datetime -> str 
from datetime import datetime
s = datetime.now()
print(s, type(s))

s1 = s.strftime('%Y-%m-%d %H:%M:%S') #이렇게 포맷을 알려줘야함 
print(s1, type(s1))

2022-06-30 15:36:14.925305 <class 'datetime.datetime'>
2022-06-30 15:36:14 <class 'str'>

In [3]:
# str -> datetime
from datetime import datetime
s = '2021-07-20 11:13:58'
print(s, type(s))

d = datetime.strptime(s, '%Y-%m-%d %H:%M:%S')#p는 파싱임 문자를 time으로 파싱한다 
print(d, type(d))

2021-07-20 11:13:58 <class 'str'>
2021-07-20 11:13:58 <class 'datetime.datetime'>

In [4]:
# str -> datetime - timestamp
s = '2021-07-20 11:13:58'
timestamp = time.mktime(datetime.strptime(s, '%Y-%m-%d %H:%M:%S').timetuple())  #인자를 str -> datetime으로 바꾼것으로 넣어 + timetuple()
print(timestamp, type(timestamp))

1626747238.0 <class 'float'>

In [5]:
#datetime -> timestamp
d = datetime.today()
print(d, type(d))

timestamp = time.mktime(d.timetuple())
print(timestamp, type(timestamp))

2022-06-30 15:36:20.035480 <class 'datetime.datetime'>
1656570980.0 <class 'float'>

In [6]:
#timestamp -> datetime
t = time.time()
print(t, type(t))

d = datetime.fromtimestamp(t) #timestamp로 부터 바꾸겠다 이런느낌
print(d, type(d))

1656570981.668603 <class 'float'>
2022-06-30 15:36:21.668603 <class 'datetime.datetime'>

In [2]:
#1년전 datetime 값
from datetime import timedelta, datetime
import time

datetime_now = datetime.now()
print(datetime_now)

delta_datetime = timedelta(days = -365) #1년 전이니까 -365를 넣는것  
print(delta_datetime) #-365 days, 0:00:00 이거니까 

datetime_now + delta_datetime

2022-07-08 03:05:33.140064
-365 days, 0:00:00

datetime.datetime(2021, 7, 8, 3, 5, 33, 140064)

In [5]:
datetime_now = datetime.now()
datetime_td = timedelta(days = -365)

datetime_now + datetime_td

datetime.datetime(2021, 7, 8, 3, 10, 1, 472591)

In [8]:
#두 날짜간의 일수 구하기
since_timestamp = datetime.strptime('20180301', '%Y%m%d')
until_timestamp = datetime.strptime('20180331', '%Y%m%d')
print(since_timestamp)
print(until_timestamp)

result = until_timestamp - since_timestamp
print(result)

2018-03-01 00:00:00
2018-03-31 00:00:00
30 days, 0:00:00

In [9]:
# 특정 요일 구하기
import datetime

def get_yoil(y, m, d):
    days = ['MON', 'TUE', 'WED', 'THU', 'FRI', 'SAT', 'SUN']
    
    return days[datetime.date(y, m, d).weekday()]

get_yoil(2022, 6, 30)

'THU'

## 판다스

In [19]:
#판다스 to_datetime
#판다스에서는 파이썬의 datetime을 timestamp라고 함.

import pandas as pd
pd.to_datetime(1656550170.8924136, unit = 's') #인자로 timestamp 값이 들어감 ,인자의 단위는 초다.

Timestamp('2022-06-30 00:49:30.892413696')

In [20]:
date = pd.Timestamp(1656550170.8924136, unit = 's', tz = 'Asia/Seoul') #tz = time zone
print(date, type(date))

2022-06-30 09:49:30.892413616+09:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [21]:
df = pd.read_csv('dataset/stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [23]:
df['New_Date'] = pd.to_datetime(df['Date']) #Date 칼럼의 데이터타입이 object니까 datetime으로 바꿔라
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   New_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [15]:
#Date 칼럼 삭제하기
df.drop('Date', axis = 1, inplace = True) #원본 반영하겠다
#원본 반영이 바로 되니까 조심해야해 그래서 원본의 복사본을 만들어놔 
df['year'] = df['New_Date'].dt.year
df['month'] = df['New_Date'].dt.month
df['day'] = df['New_Date'].dt.day
df.head()

   Close  Start   High    Low  Volume   New_Date  year  month  day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [16]:
df1 = df.copy()

In [17]:
#이런 데이터는 날짜별로 관리하는게 많아서 New_Date를 인덱스로 만들어보자
df1.set_index('New_Date', inplace = True)
df1.head()

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [18]:
#인덱스만 볼 수 있음 
df1.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='New_Date', freq=None)

In [19]:
#cf)start - 시가, high - 고가, low - 저가 
df1_ym = df1.loc['2018-07','Start':'Low'] #이렇게 월까지만 적어줘도 나오네
df1_ym

            Start   High    Low
New_Date
2018-07-02  10850  10900  10000

In [20]:
#날짜 기간을 만들어서 사용할 때 
pd.date_range(start = '2020-10-01', end = '2020-10-20', periods = 5) #periods = 5 기간에서 5개를 만들어줌

DatetimeIndex(['2020-10-01 00:00:00', '2020-10-05 18:00:00',
               '2020-10-10 12:00:00', '2020-10-15 06:00:00',
               '2020-10-20 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [21]:
dates = pd.date_range('1/1/2000', periods = 100, freq = 'W-WED') #freq = 'W-WED' 주단위 - 수요일 단위로 만들어줌 
print(dates)
#100개를 만들어줌

DatetimeIndex(['2000-01-05', '2000-01-12', '2000-01-19', '2000-01-26',
               '2000-02-02', '2000-02-09', '2000-02-16', '2000-02-23',
               '2000-03-01', '2000-03-08', '2000-03-15', '2000-03-22',
               '2000-03-29', '2000-04-05', '2000-04-12', '2000-04-19',
               '2000-04-26', '2000-05-03', '2000-05-10', '2000-05-17',
               '2000-05-24', '2000-05-31', '2000-06-07', '2000-06-14',
               '2000-06-21', '2000-06-28', '2000-07-05', '2000-07-12',
               '2000-07-19', '2000-07-26', '2000-08-02', '2000-08-09',
               '2000-08-16', '2000-08-23', '2000-08-30', '2000-09-06',
               '2000-09-13', '2000-09-20', '2000-09-27', '2000-10-04',
               '2000-10-11', '2000-10-18', '2000-10-25', '2000-11-01',
               '2000-11-08', '2000-11-15', '2000-11-22', '2000-11-29',
               '2000-12-06', '2000-12-13', '2000-12-20', '2000-12-27',
               '2001-01-03', '2001-01-10', '2001-01-17', '2001-01-24',
               '2001-01-31', '2001-02-07', '2001-02-14', '2001-02-21',
               '2001-02-28', '2001-03-07', '2001-03-14', '2001-03-21',
               '2001-03-28', '2001-04-04', '2001-04-11', '2001-04-18',
               '2001-04-25', '2001-05-02', '2001-05-09', '2001-05-16',
               '2001-05-23', '2001-05-30', '2001-06-06', '2001-06-13',
               '2001-06-20', '2001-06-27', '2001-07-04', '2001-07-11',
               '2001-07-18', '2001-07-25', '2001-08-01', '2001-08-08',
               '2001-08-15', '2001-08-22', '2001-08-29', '2001-09-05',
               '2001-09-12', '2001-09-19', '2001-09-26', '2001-10-03',
               '2001-10-10', '2001-10-17', '2001-10-24', '2001-10-31',
               '2001-11-07', '2001-11-14', '2001-11-21', '2001-11-28'],
              dtype='datetime64[ns]', freq='W-WED')

In [22]:
pd.date_range('2000-01-01', '2000-01-03 23:59', freq='4h') #4시간단위로

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

In [27]:
import pandas as pd
df = pd.read_csv('./dataset/stock-data.csv') #상대경로 할때는 .하고해줘야함 
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [28]:
%pwd

'C:\\cakd7\\m2_분석라이브러리활용\\pandas'

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [30]:
df['NewDate'] = pd.to_datetime(df.Date)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Date     20 non-null     object
 1   Close    20 non-null     int64
 2   Start    20 non-null     int64
 3   High     20 non-null     int64
 4   Low      20 non-null     int64
 5   Volume   20 non-null     int64
 6   NewDate  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [31]:
#날짜 인덱스
df1 = df.copy()
df1.set_index('NewDate', inplace = True)
df1.drop('Date', axis = 1, inplace = True)
df1.head()

            Close  Start   High    Low  Volume
NewDate
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2018-06-26  10800  10900  11000  10700   63039

In [32]:
#인덱스 리셋
df1 = df1.reset_index()
df1.head()

     NewDate  Close  Start   High    Low  Volume
0 2018-07-02  10100  10850  10900  10000  137977
1 2018-06-29  10700  10550  10900   9990  170253
2 2018-06-28  10400  10900  10950  10150  155769
3 2018-06-27  10900  10800  11050  10500  133548
4 2018-06-26  10800  10900  11000  10700   63039

In [33]:
df1['Month'] = df1.NewDate.dt.month
df1.head()

     NewDate  Close  Start   High    Low  Volume  Month
0 2018-07-02  10100  10850  10900  10000  137977      7
1 2018-06-29  10700  10550  10900   9990  170253      6
2 2018-06-28  10400  10900  10950  10150  155769      6
3 2018-06-27  10900  10800  11050  10500  133548      6
4 2018-06-26  10800  10900  11000  10700   63039      6

In [34]:
#Q. Month를 인덱스로 셋팅한 후 다시 컬럼으로 이동하세요 .

df1.set_index('Month', inplace = True)
df1.head()

         NewDate  Close  Start   High    Low  Volume
Month
7     2018-07-02  10100  10850  10900  10000  137977
6     2018-06-29  10700  10550  10900   9990  170253
6     2018-06-28  10400  10900  10950  10150  155769
6     2018-06-27  10900  10800  11050  10500  133548
6     2018-06-26  10800  10900  11000  10700   63039

In [35]:
df1 = df1.reset_index()
df1.head()

   Month    NewDate  Close  Start   High    Low  Volume
0      7 2018-07-02  10100  10850  10900  10000  137977
1      6 2018-06-29  10700  10550  10900   9990  170253
2      6 2018-06-28  10400  10900  10950  10150  155769
3      6 2018-06-27  10900  10800  11050  10500  133548
4      6 2018-06-26  10800  10900  11000  10700   63039

## 과제(6/30)
- 현재 시간을 불러와서 timestamp으로 불러와서 datetime, str로 타입을 변경한 후, 다시 timestamp으로 변경하세요. 
- 원하는 날짜 + 시간을 5개 str로 만든 후 datetime, timestamp 타입으로 변경하세요.

In [31]:
#1 timestamp -> datetime -> str -> timestamp 
# str -> timestamp를 하려면 str -> datetime -> timestamp를 해야함 

import time
from datetime import datetime
now_time = time.time()
print(now_time, type(now_time), '\n')

now_datetime = datetime.fromtimestamp(now_time)
print(now_datetime, type(now_datetime), '\n')

str_time = now_datetime.strftime('%Y-%m-%d %H:%M:%S')
print(str_time, type(str_time), '\n')

again_time = time.mktime(datetime.strptime(str_time, '%Y-%m-%d %H:%M:%S').timetuple())   
print(again_time, type(again_time))

1656573209.6744528 <class 'float'>

2022-06-30 16:13:29.674453 <class 'datetime.datetime'>

2022-06-30 16:13:29 <class 'str'>

1656573209.0 <class 'float'>

In [17]:
#str -> datetime -> timestamp 

import time
from datetime import datetime
juhee = '1998-05-21 13:23:33'
hosung = '2002-01-31 17:26:48'
jisung = '2004-05-04 14:57:23'
yujin = '2014-01-14 13:45:26'
hxxmin = '1998-08-04 13:23:33'

li = [juhee, hosung, jisung, yujin, hxxmin]
li2 = []
li3 = []
for i in li:
    
    d = datetime.strptime(i,'%Y-%m-%d %H:%M:%S')
    li2.append(d)
    
    for t in li2:
        
        f = time.mktime(t.timetuple())
    li3.append(f)

name = ['juhee', 'hosung', 'jisung', 'yujin', 'hxxmin']
result1 = dict(zip(name, li2))
result2 = dict(zip(name, li3))
print(result1, '\n')
print(result2)

{'juhee': datetime.datetime(1998, 5, 21, 13, 23, 33), 'hosung': datetime.datetime(2002, 1, 31, 17, 26, 48), 'jisung': datetime.datetime(2004, 5, 4, 14, 57, 23), 'yujin': datetime.datetime(2014, 1, 14, 13, 45, 26), 'hxxmin': datetime.datetime(1998, 8, 4, 13, 23, 33)}

{'juhee': 895724613.0, 'hosung': 1012465608.0, 'jisung': 1083650243.0, 'yujin': 1389674726.0, 'hxxmin': 902204613.0}